#membership operator
colorA = ("red", "green", "blue")
print("red" in colorA)    #การใช้ตัวดำเนินการ in เพื่อเช็คว่าค่าที่ต้องการอยู่ในทูเพิลหรือไม่ ซึ่งจะคืนค่า True ถ้าค่าที่ต้องการอยู่ในทูเพิล และ False ถ้าไม่อยู่
print("yellow" in colorA)    #การใช้ตัวดำเนินการ in เพื่อเช็คว่าค่าที่ต้องการอยู่ในทูเพิลหรือไม่ ซึ่งจะคืนค่า True ถ้าค่าที่ต้องการอยู่ในทูเพิล และ False ถ้าไม่อยู่
print("yellow" not in colorA)    #การใช้ตัวดำเนินการ not in เพื่อเช็คว่าค่าที่ต้องการไม่อยู่ในทูเพิลหรือไม่ ซึ่งจะคืนค่า True ถ้าค่าที่ต้องการไม่อยู่ในทูเพิล และ False ถ้าอยู่