# surname = "Nutthiwut"
# lastname = "Saengsaraphan"
# print("ชื่อ: " + surname + " " + lastname)


# address = """123/45          
# หมู่ 6 
# ต.บางพลีใหญ่ 
# อ.บางพลี 
# จ.สมุทรปราการ 10540"""
# print("ที่อยู่: " + address)


# #การใช้ f-string ในการแสดงผลข้อมูลที่มีตัวแปรอยู่ในข้อความ โดยใช้ {} เพื่อแทรกค่าของตัวแปรลงไปในข้อความได้อย่างสะดวกและอ่านง่าย
# year = 2548
# saraly = 50000
# print(f"ปีเกิด: {year}")    
# print(f"เงินเดือน: {saraly:.3f}")


# text = "good morning"
# print(len(text))    #ฟังก์ชัน len() ใช้ในการนับจำนวนตัวอักษรในข้อความ รวมถึงช่องว่างด้วย
# print(text[3:])
# print(text[:3])
# print(text[0:6]) 
# print(text[-7:-1]) 
# print(text[-7:])
# print(text[3])
# print(text[5:12:2])    #การใช้สไลซ์ (slice) ในการเลือกตัวอักษรจากข้อความ โดยใช้รูปแบบ [start:stop:step] ซึ่ง start คือจุดเริ่มต้น, stop คือจุดสิ้นสุด, และ step คือจำนวนตัวอักษรที่ข้ามไปในแต่ละรอบของการเลือก
# print(text[::2])     


# text1 = "Hello"
# for i in text1:
#     print(i)

# name = ("Nutthiwut")
# print(name.upper())    #ฟังก์ชัน upper() ใช้ในการแปลงตัวอักษรในข้อความให้เป็นตัวพิมพ์ใหญ่ทั้งหมด
# print(name.lower())    #ฟังก์ชัน lower() ใช้ในการแปลง
# print(name.startswith("N"))    #ฟังก์ชัน startswith() ใช้ในการตรวจสอบว่า ข้อความเริ่มต้นด้วยตัวอักษรหรือคำที่กำหนดหรือไม่ โดยจะคืนค่าเป็น True หรือ False
# print(name.endswith("t"))      #ฟังก์ชัน endswith() ใช้ในการตรวจสอบว่า ข้อความลงท้ายด้วยตัวอักษรหรือคำที่กำหนดหรือไม่ โดยจะคืนค่าเป็น True หรือ False


# month = input("ป้อนชื่อเดือน: ")
# if month.endswith("ยน"):
#     print("เดือนนี้มี 30 วัน")
# elif month.endswith("คม"): 
#     print("เดือนนี้มี 31 วัน")
# else:
#     print("เดือนนี้มี 28 หรือ 29 วัน")


# text = "Hello World"
# print(text.find("World"))    #ฟังก์ชัน find() ใช้ในการค้นหาตำแหน่งของตัวอักษรหรือคำที่กำหนดในข้อความ ถ้าไม่พบจะคืนค่าเป็น -1

# text = "Hello World"
# print(text.count("o"))    #ฟังก์ชัน count() ใช้ในการนับจำนวนครั้งที่ตัวอักษรหรือคำที่กำหนดปรากฏในข้อความ


# text = "Hello World"
# print(text.replace("o", "x"))    #ฟังก์ชัน replace() ใช้ในการแทนที่ตัวอักษรหรือคำที่กำหนดในข้อความด้วยตัวอักษรหรือคำใหม่ โดยจะคืนค่าข้อความที่ถูกแทนที่แล้ว


# text = "   Hello World   ".strip()    #ฟังก์ชัน strip() ใช้ในการลบช่องว่างที่อยู่ด้านหน้าและด้านหลังของข้อความ โดยจะคืนค่าข้อความที่ถูกลบช่องว่างแล้ว
# print(len(text))


text = "สวัสดีผมชื่อ {0} อายุ {1} เกิดปี {2}".format("Nutthiwut", 20, 2548)    #ฟังก์ชัน format() ใช้ในการแทรกค่าของตัวแปรลงไปในข้อความ โดยใช้ {} เป็นตำแหน่งที่ต้องการแทรกค่า และเรียกใช้ฟังก์ชัน format() พร้อมกับส่งค่าที่ต้องการแทรกเข้าไปในวงเล็บ
print(text)